<template>
    <div class="pro-container">
        <span style="margin:0 0 1rem 0">
            <p>你的点歌台（以下简称“本软件”）是一款简约现代化在线音乐播放器</p>
            <p>在用户（以下称“用户”或“您”）开始使用本软件前，请您先阅读以下条款。</p>
        </span>
        <h2>服务说明</h2>
        <p>
            <strong>1.1</strong>本软件的数据来源原理是从各官方音乐平台的公开服务器中拉取数据，经过对数据简单地筛选与合并后进行展示，因此本软件不对数据的准确性负责。
        </p>
        <p>
            <strong>1.2</strong>本软件内使用的部分包括但不限于UI素材、图片等资源来源于互联网，如果出现侵权可联系本软件移除。
        </p>
        <p>
            <strong>1.3</strong>使用本软件的过程中可能会产生版权数据，对于这些版权数据，本软件不拥有它们的所有权，为了避免造成侵权，使用者务必在24小时内清除使用本软件的过程中所产生的版权数据。
        </p>
        <p>
            <strong>1.4</strong>由于使用本软件产生的包括由于本条款说明或由于使用或无法使用本软件而引起的任何性质的任何直接、间接、特殊、偶然或结果性损害（包括但不限于因商誉损失、停工、计算机故障或故障引起的损害赔偿，或任何及所有其他商业损害或损失）由使用者负责。
        </p>
        <p>
            <strong>1.5</strong>本软件不对项目内的技术可能存在违反当地法律法规的行为作保证，禁止在违反当地法律法规的情况下使用本软件，对于使用者在明知或不知当地法律法规不允许的情况下使用本软件所造成的任何违法违规行为由使用者承担，本软件不承担由此造成的任何直接、间接、特殊、偶然或结果性责任。
        </p>
        <p>
            <strong>1.6</strong>本软件有权提前向用户公告（包括但不限于弹出公告、网站首页公告、系统消息)以修改、替换、升级与本软件服务相关的任何软件。如果用户不同意或者不接受本软件相关软件的修改、替代、升级，请直接拒绝、停止、取消使用行为，否则视为用户同意并接受本软件相关软件的修改、替代、升级，同时该同意并接受的行为仍受本协议约束。
        </p>
        <h2>使用规则</h2>
        <p>
            <strong>2.1</strong>用户在使用本软件服务的过程中，应遵守以下法律法规：
        <ul>
            <li><a @click="goExternal('http://www.gov.cn/zhengce/2010-04/30/content_2602243.htm')">《中华人民共和国保守国家秘密法》</a></li>
            <li><a
                    @click="goExternal('http://www.npc.gov.cn/npc/c30834/202011/848e73f58d4e4c5b82f69d25d46048c6.shtml')">《中华人民共和国著作权法》</a>
            </li>
            <li><a
                    @click="goExternal('http://www.gov.cn/gongbao/content/2011/content_1860849.htm')">《中华人民共和国计算机信息系统安全保护条例》</a>
            </li>
            <li><a @click="goExternal('http://www.gov.cn/gongbao/content/2013/content_2339471.htm')">《计算机软件保护条例》</a></li>
            <li><a @click="goExternal('http://www.gov.cn/gongbao/content/2001/content_61064.htm')">《互联网电子公告服务管理规定》</a></li>
            <li><a @click="goExternal('http://www.gov.cn/zwgk/2006-05/29/content_294000.htm')">《信息网络传播权保护条例》</a></li>
            <li><a
                    @click="goExternal('http://www.npc.gov.cn/wxzl/gongbao/2017-02/20/content_2007531.htm')">《中华人民共和国网络安全法》</a>
            </li>
            <li>其他有关计算机及互联网规定的法律、法规。</li>
        </ul>
        </p>
        <p>
            <strong>2.2</strong>在任何情况下，本软件一旦合理地认为用户的行为可能违反上述法律、法规，可以在任何时候，不经事先通知终止向该用户提供服务。
        </p>
        <p>
            <strong>2.3</strong>禁止用户从事以下行为或活动
        <ul>
            <li>以任何方式危害未成年人；</li>
            <li>冒充任何人或机构，或以虚伪不实的方式谎称或使人误认为与任何人或任何机构有关；</li>
            <li>伪造标题或以其他方式操控识别资料，使人误认为该内容为本软件所传送；</li>
            <li>干扰或破坏本软件服务或与本软件服务相连的服务器和网络；</li>
            <li>故意或非故意违反任何相关的中国法律、法规、规章、条例等其他具有法律效力的规范；</li>
        </ul>
        </p>
        <h2>知识产权</h2>
        <p>
            <strong>3.1</strong>用户不得恶意修改、复制、传播本软件服务所使用的软件、技术、材料等。否则，用户自行承担因此而造成对其他人的损害，或者造成对本软件作者形象损害，要承担相应的法律责任。
        </p>
        <p>
            <strong>3.2</strong>用户不得擅自删除、掩盖或更改本软件的版权声明或其它权利声明，否则，本软件将依法追究用户法律责任。
        </p>
        <h2>免责声明</h2>
        <p>
            <strong>4.1</strong>用户使用经由本软件服务下载或取得的任何资料，其风险由用户自行负担，因该使用而导致用户电脑系统损坏或资料流失，用户应负完全责任。
        </p>
        <p>
            <strong>4.2</strong>除非另有明确的书面说明，本软件提供给您的全部产品和服务，均是在“按现状”和“按现有”的基础上提供的。
        </p>
        <p>
            <strong>4.3</strong>用户理解并同意自主选择免费下载和使用本软件服务，风险自负，包括但不限于用户使用本软件服务过程中的行为，以及因使用本软件服务产生的一切后果。如因下载或使用本软件服务而对计算机系统造成的损坏或数据的丢失等，用户须自行承担全部责任。
        </p>
        <h2>未成年人条款</h2>
        <p>
            <strong>5.1</strong>未成年人使用本软件前应取得其监护人的同意。如您为未成年人，在使用本软件前，应在监护人监护、指导下共同阅读用户协议后使用。
        </p>
        <p>
            <strong>5.2</strong>监护人应指导子女上网应该注意的安全问题，防患于未然。本软件不鼓励未成年人使用本软件的产品/服务进行任何消费和打赏行为，如有消费和打赏，未成年人应请监护人操作或在监护人明示同意下操作。
        </p>
        <p>
            <strong>本软件Gitee项目地址：</strong>
        </p>
        <p>
            YourMusicstation:
            <a target="_blank">https://gitee.com/kikolove/yourMusicstation</a>
        </p>
    </div>
</template>

<script setup>

</script>

<style lang="less" scoped>
.pro-container {
    height: 400px;
    display: flex;
    flex-direction: column;
    overflow-y: auto;

    p {
        font-size: 13.5px;
    }
}

a {
    color: var(--defaultPrimaryColor)
}

h2 {
    font-weight: 600;
}

strong {
    margin-right: 0.4rem;
}
</style>